//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   ComHelper.h
//!
//! @brief  COM(Component Object Model)関連のヘッダファイル
//!
//! @date   2014/10/10
//!
//! @author 高木 晋
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルード防止 ====================================================
#pragma once




// ヘッダファイルの読み込み ================================================
#include <stdexcept>

#include <Windows.h>
#include <wrl.h>





// 型の別名定義 ============================================================
// ComPtr型 --------------------------------------------------------
template <typename ComInterface>
using ComPtr = Microsoft::WRL::ComPtr<ComInterface>;




