////////////////////////////////////////////////////////////////////////////
//! @file   CountTimer.h
//!
//! @brief  カウントタイマーのヘッダファイル
//!
//! @date   2016/5/23
//!
//! @author 近藤　優和
////////////////////////////////////////////////////////////////////////////


// 多重インクルード防止
#pragma once




// ------------------------------------------------------------------------
// CountTimerクラス
// ------------------------------------------------------------------------
class CountTimer
{

	static const int FRAME_NUM;	// カウントするフレームの数



	// メンバ変数 ---------------------------------------------------------
private:

	int		m_setCount;		// セットされたカウント
	int		m_frameCount;	// 計測用カウント
	bool	m_endFlag;		// 終了フラグ

	// コンストラクタ -----------------------------------------------------
public:

	CountTimer();

	// デストラクタ --------------------------------------------------------
public:

	~CountTimer();


	// メンバ関数 ----------------------------------------------------------
public:

	// タイマーのセット
	void SetTimer(int time);

	// 更新
	void Update(bool stop);

	// タイマーの状態を取得
	bool GetTimerState() { return m_endFlag; };

};
