////////////////////////////////////////////////////////////////////////////
//! @file   TitleScene.h
//!
//! @brief  タイトルシーンのヘッダファイル
//!
//! @date   2016/05/23
//!
//! @author 近藤　優和
////////////////////////////////////////////////////////////////////////////

// 多重インクルード防止 ---------------------------------------------------
#pragma once

// ヘッダの読み込み -------------------------------------------------------
#include "..\Scene.h"
#include "Framework\Graphics\SpriteManager.h"


// ---------------------------------------------------------------------------
// TitleSceneクラス
// ---------------------------------------------------------------------------
class TitleScene : public Scene
{
	// 静的メンバ変数 --------------------------------------------------------
private:
	static const wchar_t* TITLE_PATH;		// タイトル画像のパス



	// メンバ変数 ------------------------------------------------------------
private:
	
	static Scene*							pScene;				// シーン格納用
	std::unique_ptr<SpriteManager>			m_pSpriteManager;
	std::unique_ptr<Sprite>					m_pTitleSprite;

	// コンストラクタ ---------------------------------------------------------
public:

	TitleScene();


	// デストラクタ -----------------------------------------------------------
public:

	~TitleScene();



	//	メンバ関数 ------------------------------------------------------------
public:


	//-------------------------------------------------------------------------
	//! @brief タイトルシーンへのアドレスを取得する
	//!
	//! @param なし
	//!
	//! @retval pScene
	//-------------------------------------------------------------------------
	static Scene* GetInstance()
	{
		if (pScene == nullptr)
			pScene = new TitleScene();
		return pScene;
	}


	// 初期化
	void Initialize();

	// 更新
	void Update(ChangeScene* pChangeScene);

	// 描画
	void Render();

	// オブジェクトの破棄
	static void Dispose();

};
