////////////////////////////////////////////////////////////////////////////
//! @file   TitleScene.h
//!
//! @brief  タイトルシーンのヘッダファイル
//!
//! @date   2016/05/24
//!
//! @author 近藤　優和
////////////////////////////////////////////////////////////////////////////

// 多重インクルード防止 -----------------------------------------------------
#pragma once



// ヘッダの読み込み ---------------------------------------------------------
#include "..\Scene.h"
#include "Framework\Graphics\SpriteManager.h"
#include "..\ChangeScene.h"




// ---------------------------------------------------------------------------
// TitleSceneクラス
// ---------------------------------------------------------------------------
class TitleScene : public Scene
{
	// 静的メンバ変数 --------------------------------------------------------
private:

	static const wchar_t* TITLE_PATH;		// タイトル画像のパス



	// メンバ変数 ------------------------------------------------------------
private:
	
	static Scene*							pScene;				// シーン格納用
	SpriteManager*							m_pSpriteManager;
	std::shared_ptr<Sprite>					m_pTitleSprite;

	// コンストラクタ ---------------------------------------------------------
private:

	TitleScene();


	// デストラクタ -----------------------------------------------------------
private:

	virtual ~TitleScene();



	//	静的メンバ関数 --------------------------------------------------------
public:


	//-------------------------------------------------------------------------
	//! @brief タイトルシーンのアドレスを取得する
	//!
	//! @param なし
	//!
	//! @retval pScene
	//-------------------------------------------------------------------------
	static Scene* GetInstance()
	{
		if (pScene == nullptr)
			pScene = new TitleScene();
		return pScene;
	}

	// オブジェクトの破棄
	static void Dispose();


	//	メンバ関数 --------------------------------------------------------
public:

	// 初期化
	void Initialize();

	// 更新
	void Update(ChangeScene* pChangeScene)override;

	// 描画
	void Render()override;

};
