//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   DirectXToolKit.cpp
//!
//! @brief  DirectXToolKit関連のソースファイル
//!
//! @date   2014/10/10
//!
//! @author 高木 晋
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み ================================================
#include "DirectXToolKit.h"




// ライブラリの追加 ========================================================
#pragma comment(lib, "DirectXTK.lib")    // DirectX Tool Kit用ライブラリ
