//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   ScreenMode.h
//!
//! @brief  画面モード関連のヘッダファイル
//!
//! @date   2014/10/10
//!
//! @author 高木 晋
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルード防止 ====================================================
#pragma once




// 定数定義 ================================================================
//------------------------------------------------------------------
//! @brief 画面モード
//------------------------------------------------------------------
enum class ScreenMode
{
	WINDOWED,     //!< ウィンドウ表示モード
	FULLSCREEN    //!< フルスクリーンモード
};




// インライン関数の定義 ====================================================
//------------------------------------------------------------------
//! @brief ScreenMode型からbool型への明示的型変換
//!
//! @param[in] screenMode 画面モード
//!
//! @retval true  フルスクリーンモードの場合
//! @retval false ウィンドウ表示モードの場合
//------------------------------------------------------------------
inline bool toBool(ScreenMode screenMode)
{
	return screenMode == ScreenMode::FULLSCREEN;
}